app/services/orders/bulk_transition_service.rb

    def call
      return false if order_ids.empty?

      Order.where(id: order_ids).find_each do |order|
        service = TransitionService.new(order, to_state: to_state, user: user)

        if service.call
          @results[:succeeded] << {
            id: order.id,
            order_number: order.order_number,
            previous_state: order.order_transitions[-2]&.to_state || "unknown",
            new_state: order.current_state
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 226 ORDER BY "orders"."id" ASC LIMIT 1000
SELECT "order_transitions".* FROM "order_transitions" WHERE "order_transitions"."order_id" = 225