app/views/orders/_line_item_fields.html.erb

    <label class="block text-sm font-medium text-gray-700 mb-1">Product</label>
    <%= form.select :product_id,
                    options_from_collection_for_select(products, :id,
                      ->(p) { "#{p.name} (#{p.sku}) - #{p.formatted_price}" },
                      form.object.product_id),
                    { prompt: "Select a product..." },
                    { class: "block w-full rounded-md border-gray-300 shadow-sm focus:border-blue-500 focus:ring-blue-500 sm:text-sm",
                      onchange: "updateOrderTotals()" } %>
---
SELECT "products".* FROM "products" WHERE "products"."price" != 0.0 ORDER BY "products"."name" ASC