app/views/orders/index.html.erb

      <nav class="-mb-px flex space-x-8 px-6" aria-label="Tabs">
        <%= link_to orders_path, class: "#{params[:state].blank? ? 'border-indigo-500 text-indigo-600' : 'border-transparent text-gray-500 hover:text-gray-700 hover:border-gray-300'} whitespace-nowrap py-4 px-1 border-b-2 font-medium text-sm" do %>
---
SELECT 1 AS one FROM "orders" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]

          <span class="ml-2 py-0.5 px-2.5 rounded-full text-xs font-medium <%= params[:state].blank? ? 'bg-indigo-100 text-indigo-600' : 'bg-gray-100 text-gray-900' %>">
            <%= Order.count %>
---
SELECT COUNT(*) FROM "orders"

              <td class="px-6 py-4 whitespace-nowrap text-sm text-gray-500">
                <%= order.line_items.sum(:quantity) %> item(s)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" IN ($1, $2, $3, $4)  [["order_id", 24], ["order_id", 23], ["order_id", 22], ["order_id", 21]]
SELECT SUM("line_items"."quantity") FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 24]]