app/views/orders/index.html.erb

          <span class="ml-2 py-0.5 px-2.5 rounded-full text-xs font-medium <%= params[:state].blank? ? 'bg-indigo-100 text-indigo-600' : 'bg-gray-100 text-gray-900' %>">
            <%= Order.count %>
---
SELECT COUNT(*) FROM "orders"

              <td class="px-6 py-4 whitespace-nowrap text-sm text-gray-500">
                <%= order.line_items.sum(:quantity) %> item(s)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" IN (215, 198, 192, 178, 170, 163, 217, 186, 220, 211, 201, 169, 153, 209, 188, 162, 166, 185, 158, 149, 194, 177, 212, 196, 189, 183, 218, 199, 197, 155)
SELECT SUM("line_items"."quantity") FROM "line_items" WHERE "line_items"."order_id" = 215