app/views/orders/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = 215
SELECT "products".* FROM "products" WHERE "products"."id" IN (324, 311, 318)
---
            <tbody class="bg-white divide-y divide-gray-200">
              <% @order.line_items.includes(:product).each do |line_item| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
                    <% if version.whodunnit.present? %>
                      <% user = User.find_by(id: version.whodunnit) %>