app/state_machines/order_state_machine.rb


  # Guard: Can't ship without line items
  guard_transition(to: :shipped) do |order|
    order.line_items.any?
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."order_id" = 226 LIMIT 1

    SyncTrackingJob.perform_later(order.id) if defined?(SyncTrackingJob)

    # Generate tracking number if not present
    order.update(tracking_number: generate_tracking_number) unless order.tracking_number.present?
---
UPDATE "orders" SET "updated_at" = '2026-05-05 23:59:24.325862', "tracking_number" = 'TRKYMFDTOWVMFHC' WHERE "orders"."id" = 173