app/controllers/orders_controller.rb

  def index
    @orders = Order.includes(:user, :line_items, :products)
                   .order(created_at: :desc)

    # Filter by state
    if params[:state].present? && OrderStateMachine::STATES.include?(params[:state])
      @orders = @orders.in_state(params[:state])
    end

    # Search by order number or customer email
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @orders = @orders.left_joins(:user)
                       .where("orders.order_number ILIKE ? OR users.email_address ILIKE ?",
                              search_term, search_term)
    end

    # Pagination (30 per page)
    @orders = @orders.page(params[:page]).per(30)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" IN ($1, $2, $3, $4)  [["order_id", 24], ["order_id", 23], ["order_id", 22], ["order_id", 21]]
SELECT COUNT(*) FROM "orders" LEFT OUTER JOIN order_transitions AS most_recent_order_transition ON orders.id = most_recent_order_transition.order_id AND most_recent_order_transition.most_recent = TRUE WHERE (most_recent_order_transition.to_state IN ($1) AND most_recent_order_transition.to_state IS NOT NULL)  [[nil, "approved"]]
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"