app/controllers/orders_controller.rb

  def index
    @orders = Order.includes(:user, :line_items, :products)
                   .order(created_at: :desc)

    # Filter by state
    if params[:state].present? && OrderStateMachine::STATES.include?(params[:state])
      @orders = @orders.in_state(params[:state])
    end

    # Search by order number or customer email
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @orders = @orders.left_joins(:user)
                       .where("orders.order_number ILIKE ? OR users.email_address ILIKE ?",
                              search_term, search_term)
    end

    # Pagination (30 per page)
    @orders = @orders.page(params[:page]).per(30)

    # State counts for filter tabs
    @state_counts = Order.group(:current_state).count
---
SELECT "orders".* FROM "orders" LEFT OUTER JOIN order_transitions AS most_recent_order_transition ON orders.id = most_recent_order_transition.order_id AND most_recent_order_transition.most_recent = TRUE WHERE (most_recent_order_transition.to_state IN ('shipped') AND most_recent_order_transition.to_state IS NOT NULL) ORDER BY "orders"."created_at" DESC LIMIT 30 OFFSET 0
SELECT "products".* FROM "products" WHERE "products"."id" IN (324, 311, 318, 323, 313, 322, 315, 307, 305, 329, 328, 325, 306, 327, 321, 302, 316, 303, 312, 330, 326, 320, 317, 314, 308, 309, 304, 319, 301, 310)
SELECT 1 AS one FROM "orders" LEFT OUTER JOIN order_transitions AS most_recent_order_transition ON orders.id = most_recent_order_transition.order_id AND most_recent_order_transition.most_recent = TRUE WHERE (most_recent_order_transition.to_state IN ('shipped') AND most_recent_order_transition.to_state IS NOT NULL) LIMIT 1 OFFSET 0
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = 215
SELECT "orders".* FROM "orders" LEFT OUTER JOIN "users" ON "users"."id" = "orders"."user_id" WHERE (orders.order_number ILIKE '%ORD-SATQOFUOSD%' OR users.email_address ILIKE '%ORD-SATQOFUOSD%') ORDER BY "orders"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) AS "count_all", "current_state" AS "current_state" FROM "orders" GROUP BY "current_state"

  def show
    @tracking_events = @order.tracking_events.recent_first
    @order_transitions = @order.order_transitions.order(created_at: :desc)
---
SELECT "order_transitions".* FROM "order_transitions" WHERE "order_transitions"."order_id" = 215 ORDER BY "order_transitions"."created_at" DESC

  def create
    @order = Order.new(order_params)
    @order.user = Current.user

    if @order.save
---
INSERT INTO "orders" ("order_number", "subtotal", "tax", "total", "user_id", "created_at", "updated_at", "tracking_number") VALUES ('ORD-8GBXO4C7QM', 853.72, 68.3, 922.02, 11, '2026-05-06 00:11:40.657749', '2026-05-06 00:11:40.657749', NULL) RETURNING "id"

  def set_order
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 215 LIMIT 1