app/jobs/sync_tracking_job.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 173 LIMIT 1
INSERT INTO "tracking_events" ("order_id", "carrier", "tracking_number", "event_type", "description", "location", "occurred_at", "created_at", "updated_at") VALUES (173, 'DHL', 'TRKYMFDTOWVMFHC', 'shipped', 'Package picked up', 'San Diego, CA', '2026-05-04 23:59:25.180144', '2026-05-05 23:59:25.186274', '2026-05-05 23:59:25.186274') RETURNING "id"
SELECT "tracking_events".* FROM "tracking_events" WHERE "tracking_events"."order_id" = 173 AND "tracking_events"."occurred_at" = '2026-05-04 23:59:25.180144' AND "tracking_events"."event_type" = 'shipped' LIMIT 1
SELECT "tracking_events".* FROM "tracking_events" WHERE "tracking_events"."order_id" = 173 AND "tracking_events"."event_type" = 'delivered' LIMIT 1
---
  def perform(order_id)
    order = Order.find(order_id)

    # Don't sync if order doesn't have a tracking number yet
    return unless order.tracking_number.present?

    # Fetch tracking updates from simulated carrier API
    tracking_updates = CarrierApiSimulator.fetch_tracking_updates(
      order.tracking_number
    )

    # Create tracking events (skip duplicates based on occurred_at + event_type)
    tracking_updates.each do |update|
      order.tracking_events.find_or_create_by(
        occurred_at: update[:occurred_at],
        event_type: update[:event_type]
      ) do |event|
        event.carrier = update[:carrier]
        event.tracking_number = update[:tracking_number]
        event.description = update[:description]
        event.location = update[:location]
      end
    end

    # Broadcast update via Turbo Stream if order is being watched
    broadcast_tracking_update(order) if order.tracking_events.any?

    # Auto-transition to delivered state if tracking shows delivered
    if delivered_event = order.tracking_events.find_by(event_type: "delivered")